In [1]:
import pandas as pd
import numpy as np
import os
from datetime import datetime, date, time

# Load Data

In [2]:
fp = os.path.join('..', 'data_out', 'cycles.csv')
cycles = pd.read_csv(fp, parse_dates=['cycle_start_date'])

In [3]:
cycles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21962 entries, 0 to 21961
Data columns (total 3 columns):
user_id             21962 non-null int64
cycle_start_date    21962 non-null datetime64[ns]
cycle_length        21962 non-null object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 514.8+ KB

In [4]:
def parse_mmdd(id, date_in): 
    tt = date_in.timetuple()
    month_str = str(tt[1])
    year_str = str(tt[0])
    rtn_str = str(id) + year_str + month_str
    return(rtn_str)

In [5]:
cycles['key'] = ''

In [6]:
cycles.head()

   user_id cycle_start_date                cycle_length key
0      257       2015-03-10  32 days 00:00:00.000000000
1      258       2015-03-11  31 days 00:00:00.000000000
2      262       2015-03-10  33 days 00:00:00.000000000
3      269       2015-08-28  34 days 00:00:00.000000000
4      269       2015-12-02  33 days 00:00:00.000000000

In [15]:
for i in range(0, len(cycles)):
    cycles.iloc[i,3] = parse_mmdd(cycles.iloc[i, 0], cycles.iloc[i, 1])

In [16]:
cycles.head()

   user_id cycle_start_date                cycle_length        key
0      257       2015-03-10  32 days 00:00:00.000000000   25720153
1      258       2015-03-11  31 days 00:00:00.000000000   25820153
2      262       2015-03-10  33 days 00:00:00.000000000   26220153
3      269       2015-08-28  34 days 00:00:00.000000000   26920158
4      269       2015-12-02  33 days 00:00:00.000000000  269201512